Repository: Ecoblockchain/carat
Catalog: app/ios/*.lproj/Localizable.strings
Languages: fi

source: Dashboard
fi: Yleisnäkymä

# BatteryLifeLabel
source: Active Battery Life
fi: Akun kesto

source: Calibrating..
fi: Kalibroidaan..

source: Global
fi: Yleinen

source: Personal
fi: Laitekohtainen

source: Apps
fi: Sovellukset

source: Top
fi: Top-lista

source: Statistics
fi: Statistiikka

source: Actions
fi: Ehdotukset

source: MY DEVICE
fi: LAITETIEDOT

source: View
fi: Näkymä

# ViewText
source: VIEW
fi: NÄYTÄ

# UpdatedNowTxt
source: Updated just now
fi: Juuri päivitetty

source: Done
fi: Valmis

source: Loading..
fi: Ladataan..

# MainDesc
source: Carat is a research project of the University of Helsinki, originally created in collaboration with the AMP Lab at UC Berkeley, that helps detect and diagnose battery problems, giving you personalized recommendations.
fi: Carat on tutkimusprojekti Helsingin Yliopistolta ja UC Berkeleyn AMP Labista. Carat auttaa löytämään ja korjaamaan akunkeston ongelmia, ja antaa henkilökohtaisia ehdotuksia. Ehdotukset-lista kertoo, kuinka saat sinun akkusi kestämään kauemmin, ja millaisia parannuksia on luvassa. Carat kerää ja raportoi puhelimestasi yleistä käyttötietoa, joka mahdollistaa Caratin tarjoamat toiminnot. Tähän ei missään tapauksessa sisälly henkilökohtaista tietoa. Caratia kehitetään jatkuvasti, joten kannattaa tarkistaa uudet ehdotukset silloin tällöin. Mitä enemmän käytät Caratia, sitä tarkempaa tietoa se tarjoaa.

# PersonalDesc
source: Global apps consume the same amount of battery on many devices, while personal apps use a lot of energy speficially on your device.
fi: Yleisten sovellusten energiankulutus on samankaltaista useilla laitteilla, kun taas laitekohtaiset sovellukset kuluttavat enemmän energiaa juuri sinun laitteellasi.

# HogStatisticsDesc
source: Top list shows apps with highest battery consumption among all devices. It is based on worldwide results collected by Carat.
fi: Top-listalta löydät järjestyksessä ne sovellukset, jotka käyttävät kaikista eniten energiaa. Lista perustuu Caratin maailmanlaajuisiin tuloksiin.

# AppsDesc
source: Global apps consume the same amount of battery on many devices, while personal apps use a lot of energy speficially on your device.
fi: Yleisten sovellusten energiankulutus on samankaltaista useilla laitteilla, kun taas laitekohtaiset sovellukset kuluttavat enemmän energiaa juuri sinun laitteellasi.

# Eula
source: END-USER LICENSE AGREEMENT
fi: Loppukäyttäjän lisenssisopimus

source: Read EULA
fi: Lue sopimus

# EulaShortDesc
source: Carat periodically collects generic information about your device and how you are using it. In order to use this application, you need to accept the End‑user License Agreement.
fi: Carat kerää yleistä tietoa laitteestasti ja sen käytöstä. Käyttääksesi tätä sovellusta, sinun tulee hyväksyä loppukäyttäjän lisenssisopimus.

source: ACCEPT
fi: Hyväksy

# AcceptInfo
source: By proceeding you accept EULA and privacy policy.
fi: Jatkamalla hyväksyt EULA:n ja yksityisyyskäytännön

# titleScore
source: YOUR J-SCORE
fi: SINUN J-SCORE:SI

source: Carat ID
fi: Carat tunnus

# InfoJscoreLabel
source: What are j-score numbers?
fi: Mitä tarkoittaa J-Score arvosi?

source: OS version
fi: OS versio

# MyDeviceHudLabel
source: Updating Device Data
fi: Päivitä laitteen tiedot

source: Device model
fi: Laite malli

source: PROCESS LIST
fi: PROSESSILISTA

source: DEVICE USAGE
fi: LAITTEEN KÄYTTÖ

source: Memory used
fi: Muistia käytössä

source: Memory active
fi: Muistia aktiivisena

source: CPU Usage
fi: Processorin käyttö

# ExpectedImp
source: Impact:
fi: Vaikutus:

source: Type:
fi: Tyyppi:

# Samples
source: %i Samples sent
fi: Mittauksia:

source: Error
fi: Virhemarginaali:

source: Samples without
fi: Mittauksia ilman

# NumberHelpLabel
source: What are these numbers?
fi: Mitä nämä numerot tarkoittavat?

# NoBugs
source: No results, yet!
fi: Ei tuloksia, vielä!

# NoBugsMessage
source: Please check back in a week. If your apps are using the usual amount of energy, there will be no hogs here. When an app starts to use significantly more energy on your device than on others, it will show up here.
fi: Tarkista tilanne viikon päästä. Jos sovelluksesi käyttäytyvät normaalisti, tämä välilehti on tyhjä. Kun jokin sovellus alkaa käyttää huomattavasti enemmän energiaa tällä laitteella verrattuna muihin, se ilmestyy tähän.

# NoHogs
source: No results, yet!
fi: Ei tuloksia, vielä!

# NoHogsMessage
source: Please check back in a week. If your apps are using the usual amount of energy, there will be no applications here. When an app uses more energy than average, it will show up here.
fi: Tarkista tilanne viikon päästä. Jos sinulla ei ole korkean energiankulutuksen sovelluksia, tämä välilehti on tyhjä. Kun jokin sovellus alkaa käyttää huomattavasti enemmän energiaa, se ilmestyy tähän.

# WorstHogsTitle
source: Top list
fi: Top-lista

# TopHogs
source: Top list of all applications
fi: Top-lista kaikista sovelluksista

# SamplesText
source: Samples:
fi: Mittauksia:

source: Battery life impact:
fi: Vaikutus akkukestoon:

source: Reported by:
fi: Raportoinut:

# PercentageCaratUsers
source: %.2f%% of Carat users
fi: %.2f%% Caratin käyttäjistä

source: Unknown
fi: Ei tiedossa

# GlobalStatistics
source: Statistics
fi: Statistiikka

source: Global results
fi: Globaalit tulokset

source: All reports
fi: Kaikki raportit

source: General statistics
fi: Yleinen statistiikka

# pop
source: Popular device models
fi: Suosituimmat laitemallit

# ShowHogStats
source: Show application statistics
fi: Näytä statistiikkaa sovelluksista

# GenAllMessage
source: Out of %ld installed applications, %d%% are globally energy-intensive and %d%% are energy-intensive for specific users only.
fi: Kaikista %ld asennetuista sovelluksista, %d%% kuluttaa paljon virtaa kaikilla laitteilla ja %d%% vain osalla laitteista.

# GenAndroidMessage
source: Out of %ld installed Android applications, %d%% are globally energy-intensive and %d%% are energy-intensive for specific users only.
fi: Kaikista %ld asennetuista android-sovelluksista, %d%% kuluttaa paljon virtaa kaikilla laitteilla ja %d%% vain osalla laitteista.

# GenIOSMessage
source: Out of %ld installed iOS applications, %d%% are globally energy-intensive and %d%% are energy-intensive for specific users only.
fi: Kaikista %ld asennetuista iOS-sovelluksista, %d%% kuluttaa paljon virtaa kaikilla laitteilla ja %d%% vain osalla laitteista.

# GenUsersMessage
source: Out of %ld users, %d%% have at least one application with high energy consumption
fi: Caratin %ld käyttäjästä %d%% laitteella on paljon energiaa käyttäviä sovelluksia.

# WellBehaved
source: Normal Energy
fi: Hyvin käyttäytyvät

# NoNetwork
source: No network connection
fi: Ei verkkoyhteyttä

# NoGlobalData
source: Failed to load from device or from network general statistic data. You need a network connection to receive updated data.
fi: Epäonnistu lataamaan yleistä statistiikkaa niin verkosta kuin puhelimesta. Tarvitset verkkoyhteyden voidaksesi nähdä ajankohtaiset tiedot.

# ActionsDesc
source: The Actions list tells you how to make your battery last longer and how much improvement to expect.
fi: Ehdotukset-lista kertoo, kuinka saat akkusi kestämään kauemmin, ja millaisia parannuksia on luvassa.

source: Foreground App
fi: Sovellus

source: No actions.
fi: Ei suosituksia.

# ActionsHudLabel
source: Updating Action List
fi: Päivitetään suosituslistaa

# ActionHelpCollect
source: Help Carat Collect Data
fi: Auta Caratia keräämään dataa

# ActionHelpCollectSubtext
source: Better Carat results!
fi: Parempia Carat-tuloksia!

# ActionViewTopHogs
source: View applications
fi: Näytä sovellusten top-lista

# ActionViewTopHogsSubtext
source: Global energy consumption
fi: Kaikkien sovellusten top-lista

# KillAppDesc
source: From your home screen, press the home button twice. Now you should see a Process Manager. If necessary, swipe back and forth to locate the app you want to close. When you've found it, press and hold on the app icon until a red circle appears in the corner of the icon. Press this red circle. Once you are done closing apps, press the home button to close the Process Manager. If you were trying to restart the app, now simply open it again, as usual.
fi: Paina kotinäkymässäsi koti-painiketta nopeasti kaksi kertaa avataksesi sovellusten hallinnan. Jos tarpeen, pyyhkäise eteen tai taakse löytääksesi sovelluksen, jonka haluat sulkea. Kun olet löytänyt sen, paina ja pidä sovelluksen kuvaketta pohjassa kunnes punainen ympyrä ilmestyy sen ylälaitaan. Paina tuota punaista ympyrää. Kun olet sulkenut haluamasi sovellukset, paina koti-painiketta sulkeaksesi prosessinhallinnan. Jos tarkoituksenasi oli käynnistää sovellus uudestaan, voit avata sen normaaliin tapaan.

# KillAppDescModern
source: Press the home button two times quickly to see your recently used apps. If necessary, swipe those apps left or right until you find the one you want to close. Simply swipe up on that app's preview to close it. When you are ready, press your home button or tap an application to return. If you were trying to restart an app, you can simply open it again.
fi: Paina koti-painiketta nopeasti kaksi kertaa nähdäksesi äskettäin käyttämäsi sovellukset. Jos tarpeen, pyyhkäise vasemmalle tai oikealle löytääksesi sen sovelluksen, jonka haluat sulkea. Voit sulkea sovelluksen pyyhkäisemällä sen esikatselukuvaa ylöspäin. Kun haluat poistua näkymästä, paina koti-painiketta tai napauta sovellusta, johon haluat palata. Jos tarkoituksenasi oli käynnistää sovellus uudelleen, voit avata sen uudelleen normaaliin tapaan.

# CollectDataTitle
source: How to Help Carat Collect Data
fi: Kuinka autan Caratia keräämään dataa?

# CollectDataDesc
source: You should open Carat regularly so it can take samples of your device state and communicate these to our servers. We suggest opening Carat every day, or as often as you remember, especially for the first week after installing it. It can take a week or more after you install Carat for it to collect enough data to begin generating personalized reports. Make sure you give Carat a chance to communicate with our servers (i.e., open it when you have internet connectivity). The more often you open the app, the more quickly it will generate reports, the more information those reports will contain, and the more accurate the recommendations will be. Carat is not allowed to run as a background app, which is why it needs your help. The app subscribes to various notifications that let it take a few samples when it's not in the foreground, but Carat cannot reopen itself after iOS closes it (to free up resources) or after the device is restarted.
fi: Kun käytät Caratia säännöllisesti, se kerää ja lähettää mittauksia laittesi tilasta palvelimillemme. Suosittelemme avaamaan Caratin kerran päivässä, tai niin usein kuin muistat, erityisesti ensimmäisen viikon ajan. Voi mennä viikko tai pidempään ennen kuin Carat on kerännyt tarpeeksi dataa henkilökohtaisten raporttien generoimiseksi. Varmista, että Caratilla on mahdollisuus kommunikoida palvelimiemme kanssa (avaa Carat kun sinulla on aktiivinen Internet-yhteys). Mitä useammin käytät Caratia, sitä nopeammin se generoi raportteja, sitä enemmän tietoa raportit sisältävät, ja sitä tarkempia suositukset ovat. Carat ei käytä taustapalveluja laitteellasi, ja siksi se tarvitsee apuasi. Carat ottaa vastaan akunmuutosilmoituksia, jotka auttavat sitä ottamaan mittauksia kun se ei ole näkyvillä, mutta Carat ei voi avata itseään automaattisesti jos se suljetaan sovellustenhallinnasta, automaattisesti muistin säästämiseksi, tai jos puhelin käynnistetään uudelleen.

# ProcessMessage
source: Processes are lorem ipsum lorem ipsum lorem ipsum lorem ipsum lorem ipsum lorem ipsum lorem ipsum lorem ipsum lorem ipsum lorem ipsum lorem ipsum lorem ipsum
fi: Prosessilista näyttää käynnissä olevat sovellukset, taustaprosessit, ja järjestelmän osat.

source: Nothing to report!
fi: Ei tuloksia, vielä!

# EmptyViewDesc
source: You should open Carat often (e.g., daily) so it can collect the data it needs to generate reports for you. If you just installed it, this can take a week or more. Meanwhile, we'll be hard at work trying to figure out what's going on with your battery life...
fi: Caratin tulee seurata laitettasi noin viikon, jotta se voi alkaa generoimaan tietoja sovelluksistasi ja niiden energiankäytöstä. Jos sovelluksesi käyttävät normaalin verran energiaa, tämä näkymä jää tyhjäksi.

# JScoreDesc
source: The J-Score represents the percentile battery life you see relative to all other devices being measured by Carat. So, if you have a J-Score of 50, that means your expected battery life is better than half of our users; a score of 99 means you have better battery life than 99%% of our users. Of course, a single number does not provide a complete description of your battery life. A low J-Score could mean that your device is using a big battery inefficiently or a small battery with average efficiency. Similarly, a high J-Score could simply mean that you don't use your device heavily. Carat computes a huge variety of statistics, and the J-Score is just one of them.
fi: J-Score kertoo, kuinka monen parhaan joukossa Caratin käyttäjistä olet akunkeston suhteen Jos J-Scoresi on 55, akunkestosi on parempi kuin 55%:lla käyttäjistä. J-Score 99 tarkoittaa, että akunkestosi on parhaiden 1% joukossa. Tämä ei välttämättä kerro kaikkea akunkestostasi. Pieni J-Score voi johtua kovasta kulutuksesta isolla akulla, tai keskitason käytöstä pienellä akulla. Voit samasta syystä saada korkean J-Scoren unohtamalla puhelimesi lentotilaan viikoksi.

# MemoryDesc
source: The operating system (OS) classifies your device's physical memory as either used or free. If memory is used, it means there is currently data there that belongs to some process (like one of your apps or the OS, itself). When the device runs out of free memory, it needs to make room so it can store new data, which means closing apps that might be running in the background or asking your apps to throw away data they aren't using. The OS then further subcategorizes used memory as being either active or inactive, depending on whether it was accessed recently or not, respectively. When the OS runs out of free memory, it starts reclaiming inactive memory. When you open a bunch of apps, the fraction of used memory may increase; when the apps you have running are working with lots of data (often an energy-intensive task), the fraction of active memory may increase. The OS also preloads often used applications into memory, shortening wait times.
fi: Käyttöjärjestelmä (KJ) luokittelee laitteen muistin joko käytetyksi tai vapaaksi. Jos muisti on käytössä, siellä on jonkin prosessin tietoja (esim. jonkin sovelluksen tai itse käyttöjärjestelmän). Kun vapaa muisti loppuu, KJ sulkee sovelluksia tai käskee niitä poistamaan tilapäisiä tietoja muistin vapauttamiseksi. KJ luokittelee käytetyn muistin joko aktiiviseksi tai passiviseksi, riippuen siitä milloin sitä on viimeksi käytetty. Kun vapaa muisti loppuu, KJ vapauttaa ensin passiivista muistia. Kun avaat useita ohjelmia, käytetyn muistin määrä voi kasvaa. Kun käyttämäsi sovellukset avaavat paljon tiedostoja, (ja siten myös käyttävät energiaa), aktiivisen muistin määrä voi kasvaa. KJ myös lataa etukäteen usein käytettyjä sovelluksia muistiin, jotta niiden käyttö olisi jouhevampaa.

# CpuUsageDesc
source: CPU Usage shows a percentage of how much of your device's processing power is currently being used. High percentages mean that the device is fully loaded in terms of processing power, such as when playing games or installing new applications.
fi: Suorittimen käyttö kertoo, kuinka paljon laitteesi suoritustehosta on käytössä. Suuri prosenttiluku tarkoittaa, että laite on täyskuormituksessa suoritustehon suhteen, joka tapahtuu tyypillisesti pelatessa tai asentaessa uusia sovelluksia.

# WellBehavedDesc
source: These apps use an appropriate amount of energy and don't usually require user intervention.
fi: Hyvin käyttäytyvät sovellukset käyttävät sopivasti energiaa, eivätkä vaadi käyttäjältä erityisiä toimenpiteitä.

source: Settings
fi: Asetukset

# WifiOnly
source: Use Wifi only
fi: Käytä vain wifiä

# HideApps
source: Hide apps with a small impact
fi: Piilota pienen vaikutuksen sovellukset

# HideAppsTitle
source: Hide apps
fi: Piilota sovelluksia

source: Hide/Show apps
fi: Piilota/Näytä sovelluksia

source: Show hidden apps
fi: Näytä piilotetut sovellukset

# ShowStats
source: Show statistics
fi: Näytä statistiikkaa

source: Hide
fi: Piilota

source: Show
fi: Näytä

# FeedBack
source: Give feedback
fi: Anna palautetta

# Tutorial
source: Show tutorial
fi: Näytä esittely

source: About
fi: Tietoja

# AboutSub
source: General about
fi: Yleistä

# AboutMessage
source: Carat is a research project of the University of Helsinki, originally created in collaboration with the AMP Lab at UC Berkeley, that helps detect and diagnose battery problems, giving you personalized recommendations. Carat is under development, so please check back often to see new results. The more you use it, the better it will get.
fi: Kun käytät Caratia säännöllisesti, se kerää ja lähettää mittauksia laitteesi tilasta palvelimillemme. Suosittelemme avaamaan Caratin kerran päivässä, tai niin usein kuin muistat, erityisesti ensimmäisen viikon ajan. Voi mennä viikko tai pidempään ennen kuin Carat on kerännyt tarpeeksi dataa henkilökohtaisten raporttien generoimiseksi. Varmista, että Caratilla on mahdollisuus kommunikoida palvelimiemme kanssa (avaa Carat kun sinulla on aktiivinen Internet-yhteys). Mitä useammin käytät Caratia, sitä nopeammin se generoi raportteja, sitä enemmän tietoa raportit sisältävät, ja sitä tarkempia suositukset ovat. Carat ei käytä taustapalveluja laitteellasi, ja siksi se tarvitsee apuasi. Carat ottaa vastaan akunmuutosilmoituksia, jotka auttavat sitä ottamaan mittauksia kun se ei ole näkyvillä, mutta Carat ei voi avata itseään automaattisesti jos se suljetaan sovellustenhallinnasta, automaattisesti muistin säästämiseksi, tai jos puhelin käynnistetään uudelleen.

# ActionsSub
source: How to use Carat
fi: Ehdotukset

# ActionsMessage
source: The Actions list tells you how to make your battery last longer and how much improvement to expect.
fi: Ehdotukset-lista kertoo, kuinka saat sinun akkusi kestämään kauemmin, ja millaisia parannuksia on luvassa.

# PersonalSub
source: See applications
fi: Katso sovelluslista

source: Collect Data
fi: Kerää dataa

# CollectDataSub
source: Info what and how Carat collects data
fi: Tietoa miten Carat kerää dataa

# CollectDataMessage
source: Carat collects and reports generic usage statistics about your phone that allow it to do its job this process involves absolutely no personally identifying information. Period.
fi: Carat kerää ja raportoi yleisimmät käyttötiedot laitteestasi, joihin käyttöjärjestelmä sallii pääsyn. Tämä prosessi ei kerää yhtään henkilökohtaista tietoa.

source: Active Battery Life
fi: Aktiivinen akunkesto

# ActiveBatteryLifeSub
source: What does Active Battery Life mean?
fi: Mitä aktiivinen akunkesto tarkoittaa?

# ActiveBatteryLifeMessage
source: Active Battery Life approximates the amount of time your battery would last if you started from a full charge and discharged the battery at a rate that was the average of what Carat observed on your device during active use. This average rate excludes times that your device was idle and, as always, cannot account for behavior when Carat was not running. You may find that this number is much higher or lower than what you expect, but it more closely summarizes, statistically speaking, the intensity of your active device use.
fi: Aktiivinen akunkesto arvioi, kuinka kauan akkusi kestäisi aktiivisessa käytössä. Aktiivinen akunkesto ei ota huomioon laitteen lepojaksoja, eikä aikaa, jolloin Carat ei ole kerännyt mittauksia. Aktiivinen akunkesto voi olla paljon vähemmän tai enemmän kuin voisit olettaa, mutta se kuvaa tarkemmin aktiivisen käytön tilastollista intensiteettiä.

source: Show all
fi: Näytä kaikki

# Five
source: Impact < 5 min
fi: Vaikutus < 5 min

# Ten
source: Impact < 10 min
fi: Vaikutus < 10 min

# Twenty
source: Impact < 20 min
fi: Vaikutus < 20 min

# Hour
source: Impact < 1 hour
fi: Vaikutus < 1 tunti

source: Select
fi: Valitse

# JScoreShareMessage
source: My J-Score is %@. Find out yours and improve your battery life!
fi: J-Scoreni on %@. Selvitä omasi ja paranna akkusi kestävyyttä!

# CaratShareMessage
source: Carat is a free app that tells you what is using up your battery, whether that's normal, and what you can do about it.
fi: Carat on ilmainen sovellus, jolla pystyt selvittämään mikä kuluttaa akkuasi ja onko tämä normaalia vai voitko tehdä asialle jotain.

# EmailMessageTittle
source: Battery Diagnosis with Carat
fi: Akun diagnosointi Caratilla

# CaratEmailSalesPitch
source: Check out this free app called %@ that tells you what is using up your mobile device's battery, whether that's normal, and what you can do about it: http://is.gd/caratweb
fi: Tutustu tähän ilmaiseen sovellukseen %@, joka kertoo sinulle mikä kuluttaa akkuasi ja onko tämä normaalia vai voitko sinä tehdä asialle jotain : http://is.gd/caratweb

source: Updating main reports...
fi: Päivitetään laitetietoja...

# UpdatingHogReports
source: Updating global apps...
fi: Päivitetään sovelluksia...

# UpdatingBugReports
source: Updating personal apps...
fi: Päivitetään sovelluksia...

# UpdatedJust
source: Just Updated%i Samples sent
fi: Päivitetty juuri nyt%i mittausta lähetetty

# UpdatedNever
source: Updated never%i Samples sent
fi: Ei koskaan päivitetty%i mittausta lähetetty

source: Updated
fi: Päivitetty

source: ago
fi: sitten

# SamplesLabel
source: Samples
fi: Mittauksia

source: None
fi: Ei yhtään

source: selectedHogsView
fi: selectedAppsView
